<?php
########################################################################
// Пример обработчика ajax запроса
########################################################################


// Работа с корзиной, beta - набросок
########################################################################
if(isset($_POST['oper']) && $_POST['oper'] == 'save_cart'): // Сохранить корзину
	save_cart($_POST['cart']);
	
	die(json_encode([]));
endif;



########################################################################
if(isset($_POST['oper']) && $_POST['oper'] == 'load_cart'):	// Загрузка корзины
	$cart= load_cart();

	die(json_encode(['cart'=> $cart]));
endif;



########################################################################
if(isset($_POST['oper']) && $_POST['oper'] == 'checkout'):
	// Пример обработчика корзины, заглушка!
	session_start(); // Работа с сессиями
	if( !isset($_SESSION['xauthtoken']) ) { // Уникальный xauthtoken
		$_SESSION['xauthtoken']= get_xauthtoken();

	}
	
	checkout_cart();

	die(json_encode($_POST));
endif;


?>
